docs/corners/david/cs223.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-27 Mon 11:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Types of Proofs</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Taproot" />
<link rel="stylesheet" href="/global.css" type="text/css"/>
</head>
<body>
<div id="preamble" class="status">
<div class="header"><span class="site"><a href="https://taproot3.sanity.gq">TR3.5</a></span></div><div class="datarow"><h1 class="title">Types of Proofs</h1> <h2 class="subtitle"></h2> <span class="author">Taproot</span> <span class="date">2021-09-27 Mon 11:51</date></div>
</div>
<div id="content">
<div id="linktables"><div id="table-of-backlinks"><h2>Backlinks</h2><ul><li><a class='backlink' href='cs223-index.html'>CS223 Index</a></li> </ul></div><div id="table-of-contents"><h2>Table of Contents</h2><div id="text-table-of-contents">
<ul>
<li><a href="#org8ecd878">1. Types of Proofs</a></li>
<li><a href="#org3ed1987">2. Links</a></li>
</ul>
</div></div>
</div>

<div id="outline-container-org8ecd878" class="outline-2">
<h2 id="org8ecd878"><span class="section-number-2">1</span> Types of Proofs</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Proof by Example/Counterexample</li>
<li>Proof by Cases</li>
<li>Proof by Contradiction</li>
<li>Proof by Induction</li>

<li>Proof by Strong Induction</li>
</ul>

<p>
<b><b>Proof: The number of primes is infinite.</b></b>
</p>

<ul class="org-ul">
<li>This will be an example of proof by contradiction.</li>
</ul>

<p>
Assume for the purposes of contradiction that the number of primes is
finite.
</p>

<p>
Then we can list them:
</p>

<ul class="org-ul">
<li>{P~1~, P~2~, &#x2026;}</li>
</ul>

<p>
Consider the number S = P~1~ x P~2~ x P~3~ x &#x2026; + 1
</p>

<p>
Case 1: S is prime
</p>

<ul class="org-ul">
<li>Contradiction as S is not in the set.</li>
</ul>

<p>
Case 2: S is not prime
</p>

<ul class="org-ul">
<li>If S is not prime it must be divisible by at least two prime
&gt; numbers.</li>

<li>However, all primes are in that list, so if S is divided by any
&gt; number in the list the remainder will be one.</li>

<li>Contradiction!</li>
</ul>

<p>
All cases have contradictions so our assumptions must be false.
</p>

<p>
Q.E.D.
</p>

<p>
<b><b><b>Proof by induction</b></b></b>
</p>

<ul class="org-ul">
<li>Prove something is true for a smaller number and show that doing so
&gt; implies it is true for larger numbers.</li>

<li>There are 5 steps.

<ul class="org-ul">
<li>Declare proof by induction</li>

<li>Declare inductive hypothesis

<ul class="org-ul">
<li>Inductive hypothesis is typically whatever you are trying to
&gt; prove.</li>
</ul></li>

<li>Prove the base case

<ul class="org-ul">
<li>Like dominos where a proof of one number leads to the proof
&gt; of the next number</li>
</ul></li>

<li>Show that P(n) → P(n+1)</li>

<li>Invoke induction.</li>
</ul></li>
</ul>

<p>
<b><b>Proof: 1+2+3&#x2026;+n = n(n+1)/2</b></b>
</p>

<ul class="org-ul">
<li>Proof is by induction.</li>
</ul>

<p>
P(n) is the hypothesis that 1+2+3&#x2026;+n = n(n+1)/2
</p>

<p>
P(1):
</p>

<p>
1 = 1(1+1)/2
</p>

<p>
1 = 2/2
</p>

<p>
1 = 1
</p>

<p>
P(n+1):
</p>

<p>
We need to show 1+2+3+4&#x2026;+n+n+1 = ((n+1)(n+2))/2
</p>

<p>
Assume that P(n) is true.
</p>

<p>
Left side simplifies to (n(n+1)/2) + (n+1)
</p>

<p>
Algebraic manipulation leaves you with ((n+2)(n+1))/2
</p>

<p>
If P(n) is true then P(n+1) is true and P(1) is true therefore P(n) is
true for all numbers.
</p>

<p>
<b><b>Proof by Strong Induction</b></b>
</p>

<ul class="org-ul">
<li>Use P(1), P(2) &#x2026;. P(n) to prove P(n+1)</li>

<li>Same list but instead of proving P(n) → P(n+1) it will be P(1),
&gt; P(2)\&#x2026; P(n) → P(n+1)</li>
</ul>

<p>
Proof: Any group of students ≥ 12 can be divided into some combination
of groups of 4 and groups of 5.
</p>

<ul class="org-ul">
<li>This will be a proof by strong induction.</li>
</ul>

<p>
P(12) = 4+4+4
</p>

<p>
P(13) = 4+4+5
</p>

<p>
P(14) = 4+5+5
</p>

<p>
P(15) = 5+5+5
</p>

<p>
P(n) → P(n+4)
</p>

<p>
If P(n-3) is true, then there exists a combination of groups of 4 and 5
to make up (n-3) students. Add a group of 4 and that gives us out
combination for (n+1) students.
</p>

<p>
P(n-3) → P(n+1)
</p>

<p>
By induction this is true for all n ≥ 12
</p>
</div>
</div>

<div id="outline-container-org3ed1987" class="outline-2">
<h2 id="org3ed1987"><span class="section-number-2">2</span> Links</h2>
<div class="outline-text-2" id="text-2">
<p>
See <a href="cs223-induction.html">Induction</a> for more examples.
</p>
</div>
</div>
</div>
</body>
</html>
